import type { Message } from "@/types/message";

export const messages: Message[] = [
    {
        id: 1,
        userId: 1,
        text: "Всем привет! Как продвигается задача?",
        time: "15:00",
    },
    {
        id: 2,
        userId: 2,
        text: "Привет! Я уже закончил свою часть.",
        time: "16:00",
    },
    {
        id: 3,
        userId: 2,
        text: "Осталось только дождаться ревью.",
        time: "16:00",
    },
    {
        id: 4,
        userId: 1,
        text: "Отлично, я посмотрю после обеда.",
        time: "18:00",
    },
    {
        id: 5,
        userId: 3,
        text: "Я пока занимаюсь адаптивом.",
        time: "20:00",
    },
    {
        id: 6,
        userId: 3,
        text: "На мобильных осталось несколько проблем.",
        time: "20:00",
    },
    {
        id: 7,
        userId: 3,
        text: "Особенно с боковой панелью.",
        time: "20:00",
    },
    {
        id: 8,
        userId: 1,
        text: "Понял, давайте тогда обсудим это на созвоне.",
        time: "09:25",
    },
    {
        id: 9,
        userId: 4,
        text: "Я добавил новые макеты в Figma.",
        time: "09:30",
    },
    {
        id: 10,
        userId: 4,
        text: "Посмотрите, пожалуйста, когда будет время.",
        time: "09:30",
    },
    {
        id: 11,
        userId: 2,
        text: "Выглядит хорошо. Только нужно поправить отступы.",
        time: "09:35",
    },
    {
        id: 12,
        userId: 1,
        text: "Окей, тогда фиксируем это в задаче.",
        time: "09:40",
    },
    {
        id: 13,
        userId: 1,
        text: "И не забудьте обновить статус после завершения.",
        time: "09:40",
    },
    {
        id: 14,
        userId: 5,
        text: "Я сегодня подключусь к этому после 14:00.",
        time: "09:45",
    },
    {
        id: 15,
        userId: 2,
        text: "Хорошо 👍",
        time: "09:46",
    },
];